{
  "setting" :{
    "role" :"دور",
    "developer" :"مطور"
  },
  "developer": {
    "name": "عبد الله أطغيري",
    "role": "مطور Full-Stack",
    "location": "المغرب"
  },
  "about_me": {
    "title": "نبذة عني",
    "description": "أنا مطور ويب كامل المكدس مع خبرة في تطوير تطبيقات الويب باستخدام تقنيات مثل React و Node.js و Express و MongoDB. أتمتع بخبرة في تصميم واجهات المستخدم وتجربة المستخدم، بالإضافة إلى تطوير واجهات برمجة التطبيقات وقواعد البيانات. أعمل بشكل جيد في بيئات الفريق وأحب حل المشكلات المعقدة."
  },
  "experience": {
    "title": "الخبرة المهنية",
    "companies": {
      "cod_network": {
        "title": "Cod Network، أكادير، المغرب",
        "position": "مطور مبتدئ Full-Stack",
        "date": "يونيو 2023 - الآن",
        "description": "خلال فترة تدريبي في Agriwise، ركزت على تطوير الواجهة الأمامية باستخدام Vue.js و Tailwind CSS و Element Plus لإنشاء واجهات مستخدم ديناميكية ومتجاوبة. عملت على مشروع منصة لإدارة الزراعة، مما أكسبني خبرة عملية في إدارة المزارع. كما استخدمت Laravel في بعض المهام الخلفية، مما عزز مهاراتي في تكامل واجهات برمجة التطبيقات (APIs) ومعالجة البيانات. مكنتني هذه التجربة أيضًا من العمل في بيئة Agile، متبعًا منهجيات Scrum لتحسين التعاون وكفاءة المشاريع."
      },
      "agriwise": {
        "title": "Agriwise، أكادير، المغرب",
        "position": "متدرب مطور Full-Stack (Laravel/Vue.js)",
        "date": "يناير 2023 - فبراير 2023",
        "description": "خلال فترة تدريبي في Agriwise، ركزت على تطوير الواجهة الأمامية باستخدام Vue.js و Tailwind CSS و Element Plus لإنشاء واجهات مستخدم ديناميكية ومتجاوبة. عملت على مشروع منصة لإدارة الزراعة، مما أكسبني خبرة عملية في إدارة المزارع. كما استخدمت Laravel في بعض المهام الخلفية، مما عزز مهاراتي في تكامل واجهات برمجة التطبيقات (APIs) ومعالجة البيانات. مكنتني هذه التجربة أيضًا من العمل في بيئة Agile، متبعًا منهجيات Scrum لتحسين التعاون وكفاءة المشاريع."
      },
      "digital_elite": {
        "title": "Digital Elite، أكادير، المغرب",
        "position": "متدرب مطور ويب Full-Stack",
        "date": "مارس 2023 - مايو 2023",
        "description": "خلال تدريبي الأول في Digital Elite، اكتسبت خبرة عملية في تطوير الويب باستخدام React و Node.js، وشاركت في مشاريع حقيقية. مكنتني هذه التجربة من تطوير فهم قوي لـ منهجيات Agile، والعمل الجماعي، و التواصل الفعّال داخل بيئة الشركة. كما تعلمت أفضل الممارسات في تطوير البرمجيات، مما ساعدني في كتابة كود نظيف وقابل للصيانة، بالإضافة إلى التعاون بكفاءة في بيئة مهنية."
      }
    }
  },
  "hobbies": {
    "title": "الهوايات",
    "coding": {
      "title": "البرمجة",
      "description": "أحب البرمجة وأستمتع بالعمل على المشاريع الشخصية في وقت فراغي. أبحث دائمًا عن تعلم تقنيات جديدة وتحسين مهاراتي."
    },
    "reading": {
      "title": "القراءة",
      "description": "أستمتع بقراءة الكتب، خاصة في مجالات الخيال العلمي والتكنولوجيا. أعتقد أن القراءة تساعدني على توسيع معرفتي وإبداعي."
    },
    "gaming": {
      "title": "الألعاب",
      "description": "أستمتع بلعب ألعاب الفيديو في وقت فراغي. يساعدني ذلك على الاسترخاء بعد يوم طويل من البرمجة."
    },
    "exploring": {
      "title": "الاستكشاف",
      "description": "أحب استكشاف أماكن وثقافات جديدة. يساعدني السفر على اكتساب وجهات نظر وأفكار جديدة يمكنني تطبيقها في عملي."
    },
    "personal_projects": {
      "title": "المشاريع الشخصية",
      "description": "أستمتع بالعمل على المشاريع الشخصية التي تتيح لي تجربة تقنيات وأفكار جديدة. أعتقد أن المشاريع الشخصية هي وسيلة رائعة للتعلم والنمو كمطور."
    },
    "music": {
      "title": "الموسيقى",
      "description": "أحب الاستماع إلى الموسيقى أثناء البرمجة. يساعدني ذلك على التركيز والبقاء متحمسًا."
    },
    "learning": {
      "title": "التعلم",
      "description": "أبحث دائمًا عن تعلم تقنيات جديدة وتحسين مهاراتي. أستمتع بالتعرف على لغات البرمجة الجديدة والأطر والأدوات."
    },
    "basketball": {
      "title": "كرة السلة",
      "description": "أستمتع بلعب كرة السلة ومشاهدة مباريات كرة السلة. يساعدني ذلك على البقاء في حالة جيدة وصحية."
    },
    "problem_solving":{
      "title" : "حل المشكلات",
      "description": "المشاركة في الأنشطة التي تتحدى تفكيري المنطقي وإبداعي، مما يساعدني على تطوير حلول فعالة للمشاكل المعقدة."
    }
  },
  "technical_skills": {
    "title": "المهارات التقنية",
    "frontend": {
      "title": "تطوير الواجهة المستخدم",
      "description": "احتاج إلى تقنيات تطوير الواجهة المستخدم مثل HTML، CSS، و JavaScript. أحتاج إلى تقنيات مثل React و Vue.js."
    },
    "backend": {
      "title": "تطوير الخلفية",
      "description": "احتاج إلى تقنيات تطوير الخلفية مثل Node.js، Express، و MongoDB. أحتاج إلى بناء واجهات برمجة التطبيقات RESTful والعمل مع قواعد البيانات."
    },
    "database": {
      "title": "إدارة قواعد البيانات",
      "description": "احتاج إلى تقنيات إدارة قواعد البيانات مثل MongoDB، MySQL، و PostgreSQL. أحتاج إلى تصميم وتحسين مخططات قواعد البيانات."
    },
    "version_control": {
      "title": "تحكم الإصدارات",
      "description": "احتاج إلى تقنيات تحكم الإصدارات مثل Git و GitHub. أحتاج إلى العمل مع فرق باستخدام نظم تحكم الإصدارات."
    },
    "others": {
      "title": "المهارات الأخرى",
      "description": "احتاج إلى تقنيات أخرى مثل Docker، Kubernetes، و CI/CD. أحتاج إلى العمل مع فرق باستخدام نظم تحكم الإصدارات."
    }
  },
  "education": {
    "title": "التعليم",
    "diploma": {
      "high_school": {
        "title": "دبلوم الثانوية العامة",
        "school": "مدرسة الحسن الثاني، آسفي، المغرب",
        "date": "أغسطس 2019",
        "description": "تخرجت من الثانوية العامة مع التركيز على العلوم والفيزياء."
      },
      "youcode": {
        "title": "دبلوم في التطوير الشامل",
        "school": "يوكود، آسفي، المغرب",
        "date": "سبتمبر 2023",
        "description": "أكملت برنامجًا شاملًا في التطوير الشامل، يشمل تقنيات الواجهة الأمامية والخلفية."
      }
    }
  },
  "projects": {
    "title": "المشاريع",
    "description": "هنا بعض المشاريع التي عملت عليها مؤخرًا. يمكنك الاطلاع على المزيد من مشاريعي على GitHub.",
    "project_1": {
      "title": "تطبيق إدارة المهام",
      "description": "تطبيق إدارة المهام يسمح للمستخدمين بانشاء، تحديث واختيار المهام."
    },
    "project_2": {
      "title": "تطبيق تجارة الكترونية",
      "description": "تطبيق تجارة الكترونية يستخدم Laravel للخلفية، React.js للواجهة المستخدمة، و MySQL لاستخدام البيانات."
    },
    "project_3": {
      "title": "تطبيق حجز المطاعم الاونلاين",
      "description": "تطبيق حجز المطاعم الاونلاين يهدف لسهولة الوصول للمطاعم وحجزها."
    },
    "project_4": {
      "title": "ويتريال جير يوب",
      "description": "ويتريال جير يوب هو منصة تجارية الكترونية تقدم للاستخدام اللائحة للملعبات الافتراضية."
    }
  }
}
