{
  "setting": {
    "role": "role",
    "developer": "developer",
    "technologies": "technologies"
  },
  "developer": {
    "name": "Abdallah ATGUIRI",
    "role": "Full-Stack Developer",
    "location": "Morocco",
    "email": "abdallah.atguiri@gmail.com",
    "phone": "+212 623 779 270"
  },
  "about_me": {
    "title": "About Me",
    "description": "I’m Abdallah Atguiri, a passionate Full Stack Web Developer with a flair for crafting smooth user experiences and building solid, scalable backends. I love turning ideas into interactive web apps that are not only functional but also delightful to use."
  },
  "experience": {
    "title": "Professional Experience",
    "companies": {
      "cod_network": {
        "title": "Cod Network, Agadir, Morocco",
        "position": "Junior Full-Stack Developer",
        "date": "June 2023 - Present",
        "description": "I specialize in Laravel and JavaScript frontend frameworks, including Vue.js and React. My expertise includes backend optimization, API development, and authentication using Laravel Passport. On the frontend, I craft dynamic user experiences with Tailwind CSS, Material-UI, and Redux. I have hands-on experience in e-commerce platforms, ensuring high performance, scalability, and a seamless user experience."
      },
      "agriwise": {
        "title": "Agriwise, Agadir, Morocco",
        "position": "Full-Stack Developer Intern (Laravel/Vue.js)",
        "date": "January 2023 - February 2023",
        "description": "During my internship at Agriwise, I focused on frontend development using Vue.js, Tailwind CSS, and Element Plus to build dynamic and responsive user interfaces. I collaborated in an agriculture management platform project, gaining hands-on experience in farm management solutions. Additionally, I worked with Laravel for backend tasks. This experience also enhanced my ability to work in an Agile environment, following Scrum methodologies to improve teamwork and project efficiency"
      },
      "digital_elite": {
        "title": "Digital Elite, Agadir, Morocco",
        "position": "Full-Stack Web Developer Intern",
        "date": "March 2023 - May 2023",
        "description": "Contributed to React and Node.js projects, adopting Agile methodologies and clean code practices, improving teamwork and communication while delivering maintainable solutions in a professional environment."
      }
    }
  },
  "hobbies": {
    "title": "Hobbies",
    "coding": {
      "name": "Coding",
      "description": "I love coding and enjoy working on personal projects in my spare time. I am always looking to learn new technologies and improve my skills."
    },
    "reading": {
      "name": "Reading",
      "description": "I enjoy reading books, especially in the genres of science fiction and technology. I believe that reading helps me to expand my knowledge and creativity."
    },
    "gaming": {
      "name": "Gaming",
      "description": "I enjoy playing video games in my free time. It helps me to relax and unwind after a long day of coding."
    },
    "exploring": {
      "name": "Exploring",
      "description": "I love exploring new places and cultures. Traveling helps me to gain new perspectives and ideas that I can apply to my work."
    },
    "personal_projects": {
      "name": "Personal Projects",
      "description": "I enjoy working on personal projects that allow me to experiment with new technologies and ideas. I believe that personal projects are a great way to learn and grow as a developer."
    },
    "learning": {
      "name": "Learning",
      "description": "I am always looking to learn new technologies and improve my skills. I enjoy learning about new programming languages, frameworks, and tools."
    },
    "basketball": {
      "name": "Basketball",
      "description": "I enjoy playing basketball and watching basketball games. It helps me to stay fit and healthy."
    },
    "music": {
      "name": "Music",
      "description": "I enjoy listening to music, especially in genres such as pop, rock, and electronic. It helps me to relax and unwind."
    },
    "problem_solving": {
      "name": "Problem solving",
      "description": "Engaging in activities that challenge my logical thinking and creativity, helping me to develop effective solutions for complex problems."
    }
  },
  "languages": {
    "title": "Languages",
    "arabic": {
      "name": "Arabic",
      "level": "Native Speaker"
    },
    "french": {
      "name": "French",
      "level": "Beginner"
    },
    "english": {
      "name": "English",
      "level": "Intermediate"
    }
  },
  "technical_skills": {
    "title": "Technical Skills",
    "frontend": {
      "title": "Front-End Development",
      "description": "I am proficient in front-end development using technologies like HTML, CSS, and JavaScript. I have expertise in frameworks like React and Vue.js."
    },
    "backend": {
      "title": "Back-End Development",
      "description": "I am proficient in back-end development using technologies like Node.js, Express, and MongoDB. I have expertise in building RESTful APIs and working with databases."
    },
    "database": {
      "title": "Database Management",
      "description": "I am proficient in database management using technologies like MongoDB, MySQL, and PostgreSQL. I have expertise in designing and optimizing database schemas."
    },
    "version_control": {
      "title": "Version Control",
      "description": "I am proficient in version control using Git and GitHub. I have experience in collaborating with teams using version control systems."
    },
    "others": {
      "title": "Other Skills",
      "description": "I have experience in other technologies and tools such as Docker, Kubernetes, and AWS. I am always looking to learn new skills and improve my knowledge."
    }
  },
  "education": {
    "title": "Education",
    "diploma": {
      "high_school": {
        "title": "High School Diploma",
        "school": "School Hassan II School, Safi, Morocco",
        "date": "August 2019",
        "description": "I graduated from high school with a focus on science and Physics."
      },
      "youcode": {
        "title": "Diploma in Full-Stack Development",
        "school": "YouCode, Safi, Morocco",
        "date": "September 2023",
        "description": "I completed a comprehensive program in full-stack development, covering both front-end and back-end technologies."
      }
    }
  },
  "projects": {
    "title": "Projects",
    "project_1": {
      "title": "Task Management App",
      "description": "A task management app that allows users to create, manage, and prioritize tasks."
    },
    "project_2": {
      "title": "E-commerce Platform",
      "description": " Laravel backend serves as the core of our e-commerce platform, handling server-side logic, data storage, and providing API endpoints for our React.js frontend. It includes features such as user authentication, product management, and order processing.."
    },
    "project_3": {
      "title": "Online Restaurant Reservation Application",
      "description": "The proposed online restaurant reservation application aims to address these issues by providing customers with a simple, user-friendly platform to search for and book reservations at their desired restaurants, while also giving restaurants the tools they need to manage reservations more efficiently."
    },
    "project_4": {
      "title": "Virtual Gear Hub",
      "description": "Virtual Gear Hub is an innovative e-commerce platform designed to provide gamers with a wide selection of high-quality accessories for virtual reality (VR) gaming. The platform caters to both casual and professional gamers, offering a diverse range of VR gear, including motion controllers, haptic feedback gloves, headsets, tracking systems"
    }
  }
}
